import { SlashCommandBuilder } from "discord.js";

export const data = new SlashCommandBuilder()
  .setName("seibu")
  .setDescription("西武全線の中から１駅を自動的に選出します");

export async function execute(interaction) {
  const arr = [
    "西武秩父",
    "お花畑（秩父鉄道）",
    "横瀬",
    "芦ヶ久保",
    "正丸",
    "西吾野",
    "西吾野",
    "吾野",
    "東吾野",
    "武蔵横手",
    "高麗",
    "東飯能",
    "飯能",
    "元加治",
    "仏子",
    "入間市",
    "荷山公園",
    "武蔵藤沢",
    "挟山ヶ丘",
    "小手指",
    "西所沢",
    "所沢",
    "下山口",
    "西部球場前",
    "西武園ゆうえんち",
    "多摩湖",
    "武蔵大和",
    "八坂",
    "萩山",
    "秋津",
    "清瀬",
    "東久留米",
    "ひばりが丘",
    "保谷",
    "大泉学園",
    "石神井公園",
    "練馬高野台",
    "富士見台",
    "中村橋",
    "練馬",
    "豊島園",
    "新桜台",
    "小竹向原",
    "桜台",
    "江古田",
    "東長崎",
    "椎名町",
    "池袋",
    "航空公園",
    "新所沢",
    "入曽",
    "狭山市",
    "新狭山",
    "南大塚",
    "本川越",
    "東村山",
    "西武園",
    "久米川",
    "小平",
    "花小金井",
    "田無",
    "西部柳沢",
    "東伏見",
    "武蔵関",
    "上石神井",
    "上井草",
    "井荻",
    "下井草",
    "鷲ノ宮",
    "都立家政",
    "野方",
    "沼袋",
    "新井薬剤師前",
    "中井",
    "下落合",
    "高田馬場",
    "西武新宿",
    "拝島",
    "西武立川",
    "武蔵砂川",
    "玉川上水",
    "東大和市",
    "小川",
    "鷹の台",
    "恋ヶ窪",
    "国分寺",
    "一橋学園",
    "青梅街道",
    "武蔵境",
    "新小金井",
    "多摩",
    "白糸台",
    "競艇場前",
    "是政",
  ];

  const weight = [
    1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1,
    1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1,
    1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1,
    1, 1, 1, 1, 1, 1, 1, 1,　1, 1, 1, 1, 1, 1, 1, 1, 1, 1,
  ];
  let result = "";

  let totalWeight = 0;
  for (let i = 0; i < weight.length; i++) {
    totalWeight += weight[i];
  }
  let random = Math.floor(Math.random() * totalWeight);

  for (let i = 0; i < weight.length; i++) {
    if (random < weight[i]) {
      result = arr[i];
      break;
    } else {
      random -= weight[i];
    }
  }

  await interaction.reply(`${result} `);
}
