import { SlashCommandBuilder } from "discord.js";

export const data = new SlashCommandBuilder()
  .setName("shinkansen")
  .setDescription("日本全国の新幹線の駅から１駅をを自動的に選出します");

export async function execute(interaction) {
  const arr = [
    "東京",
    "品川",
    "新横浜",
    "小田原",
    "熱海",
    "三島",
    "新富士",
    "静岡",
    "掛川",
    "浜松",
    "豊橋",
    "三河安城",
    "名古屋",
    "岐阜羽島",
    "米原",
    "京都",
    "新大阪",
    "新神戸",
    "西明石",
    "姫路",
    "相生",
    "岡山",
    "新倉敷",
    "福山",
    "新尾道",
    "三原",
    "東広島",
    "広島",
    "新岩国",
    "徳山",
    "新山口",
    "厚挟",
    "新下関",
    "小倉",
    "博多",
    "新鳥栖",
    "久留米",
    "筑後船小屋",
    "新大牟田",
    "新玉名",
    "熊本",
    "新八代",
    "新水俣",
    "出水",
    "川内",
    "鹿児島中央",
    "上野",
    "大宮",
    "熊谷",
    "本庄早稲田",
    "高崎",
    "安中榛名",
    "軽井沢",
    "佐久平",
    "上田",
    "長野",
    "飯山",
    "上越妙高",
    "糸魚川",
    "黒部宇奈月温泉",
    "富山",
    "新富岡",
    "金沢",
    "小松",
    "加賀温泉",
    "芦原温泉",
    "福井",
    "越前たけふ",
    "敦賀",
    "小山",
    "宇都宮",
    "那須塩原",
    "新白河",
    "郡山",
    "白石蔵王",
    "仙台",
    "福島",
    "古川",
    "くりこま高原",
    "一ノ関",
    "水沢江刺",
    "北上",
    "新花巻",
    "盛岡",
    "いわて沼宮内",
    "二戸",
    "八戸",
    "七戸十和田",
    "新青森",
    "奥津軽いまべつ",
    "木古内",
    "新函館北斗",
    "米沢",
    "高畠",
    "赤湯",
    "かみのやま温泉",
    "山形",
    "天童",
    "さくらんぼ東根",
    "村山",
    "大石田",
    "新庄",
  ];
  const weight = [
    1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1,
    1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1,
    1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1,
    1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1,
    1,
  ];
  let result = "";

  let totalWeight = 0;
  for (let i = 0; i < weight.length; i++) {
    totalWeight += weight[i];
  }
  let random = Math.floor(Math.random() * totalWeight);

  for (let i = 0; i < weight.length; i++) {
    if (random < weight[i]) {
      result = arr[i];
      break;
    } else {
      random -= weight[i];
    }
  }

  await interaction.reply(`${result} `);
}