import { SlashCommandBuilder } from "discord.js";

export const data = new SlashCommandBuilder()
  .setName("tokyu")
  .setDescription("東急の駅を自動的に選出します");

export async function execute(interaction) {
  const arr = [
    "中央林間",
    "つきみ野",
    "南町田グランベリーパーク",
    "すずかけ台",
    "つくし野",
    "長津田",
    "田奈",
    "青葉台",
    "藤が丘",
    "市ヶ尾",
    "江田",
    "あざみ野",
    "たまプラーザ",
    "鷺沼",
    "宮前平",
    "宮前台",
    "梶ヶ谷",
    "溝の口",
    "高津",
    "二子新地",
    "二子玉川",
    "用賀",
    "桜新町",
    "駒沢大学",
    "三軒茶屋",
    "池尻大橋",
    "渋谷",
    "西太子堂",
    "若林",
    "松陰神社前",
    "世田谷",
    "上町",
    "宮の坂",
    "山下",
    "松原",
    "下高井戸",
    "上野毛",
    "等々力",
    "尾山台",
    "九品仏",
    "自由が丘",
    "緑が丘",
    "大岡山",
    "北千束",
    "旗の台",
    "荏原町",
    "中延",
    "戸越公園",
    "下神明",
    "大井町",
    "代官山",
    "中目黒",
    "祐天寺",
    "学芸大学",
    "都立大学",
    "田園調布",
    "多摩川",
    "新丸子",
    "武蔵小杉",
    "元住吉",
    "日吉",
    "新綱島",
    "新横浜",
    "綱島",
    "大倉山",
    "菊名",
    "妙蓮寺",
    "白楽",
    "東白楽",
    "反町",
    "横浜",
    "沼部",
    "鵜の木",
    "新丸子",
    "武蔵新田",
    "矢口渡",
    "蒲田",
    "蓮沼",
    "池上",
    "千鳥町",
    "久が原",
    "御嶽山",
    "雪が谷大塚",
    "石川台",
    "洗足池",
    "長原",
    "荏原中延",
    "戸越銀座",
    "大崎広小路",
    "五反田",
    "目黒",
    "不動産",
    "武蔵小山",
    "西小山",
    "洗足",
    "奥沢",
    "田園調布",
    "恩田",
    "こどもの国",
  ];
  const weight = [
    1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1,
    1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1,
    1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1,
    1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1,
  ];
  let result = "";

  let totalWeight = 0;
  for (let i = 0; i < weight.length; i++) {
    totalWeight += weight[i];
  }
  let random = Math.floor(Math.random() * totalWeight);

  for (let i = 0; i < weight.length; i++) {
    if (random < weight[i]) {
      result = arr[i];
      break;
    } else {
      random -= weight[i];
    }
  }

  await interaction.reply(`${result} `);
}
