import { SlashCommandBuilder } from "discord.js";

export const data = new SlashCommandBuilder()
  .setName("toubu")
  .setDescription("東武線の駅を自動的に選出します");

export async function execute(interaction) {
  const arr = ["浅草", "とうきょうスカイツリー","押上","曳舟","東向島","鐘ヶ淵","堀切","牛田","北千住","小菅","五反野","梅島","西新井","竹ノ塚","谷塚","草加","獨協大学前","新田","蒲生","新越谷","越谷","北越谷","大袋","せんげん台","武里","一ノ割","春日部","北春日部","姫宮","東武動物公園","小村井","東あずま","亀戸水神","亀戸","大師前",
    "船橋","新船橋","塚田","馬込沢","鎌ヶ谷","新鎌ヶ谷","六実","高柳","逆井","増尾","新柏","柏","豊四季","流山おおたかの森","初石","江戸川台","運河","梅郷","野田市","愛宕","清水公園","七光台","川間","南桜井","藤の牛島","八木崎","豊春","東岩槻","岩槻","七里","大和田",
    "大宮公園","北大宮","大宮","和戸","久喜","鷲宮","花崎","加須","南羽生","羽生","川俣","茂林寺前","館林","多々良","県","福居","東武和泉","足利市","野州山辺","韮川","太田","細谷","木崎","世良田","境町","剛志","新伊勢崎","伊勢崎","杉戸高野台","幸手","南栗橋","栗橋","新古河","柳生","板倉東洋大前","藤岡","静和","新大平下","栃木","新栃木",
    "合戦場","家中","東武金崎","楡木","樅山","新鹿沼","北鹿沼","板荷","下小代","明神","下今市","上今市","東武日光","野州平川","野州大塚","壬生","国谷","おもちゃのまち","安塚","西川田","江曽島","南宇都宮","東武宇都宮","池袋","北池袋","下板橋","大山","中板橋","ときわ台","上板橋","東武練馬","下赤塚","成増","和光市","朝霞","朝霞台","志木","柳瀬川",
  　"みずほ台","鶴瀬","ふじみ野","上福岡","新河岸","川越","川越市","霞ヶ関","鶴ヶ島","若葉","坂戸","北坂戸","高坂","東松山","森林公園","つきのわ","武蔵嵐山","小川町","東武竹沢","みなみ寄居＜ホンダ寄居前＞","男衾","鉢形","玉淀","寄居","一本松","西大家","川角","武州長瀬","東毛呂","武州唐沢","越生","三枚橋","治良門橋","薮塚","阿佐美","新桐生","相生","赤城",
    "大谷向","大桑","新高徳","小佐越","東武ワールドスクウェア","鬼怒川温泉","鬼怒川公園","新藤原","成島","本中野","篠塚","東小泉","小泉町","西小泉","竜舞","渡瀬","田島","佐野市","佐野","堀米","吉水","田沼","多田","葛生"];
  const weight = [1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1,
 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1,
 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1,
 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1,];
  let result = "";

  let totalWeight = 0;
  for (let i = 0; i < weight.length; i++) {
    totalWeight += weight[i];
  }
  let random = Math.floor(Math.random() * totalWeight);

  for (let i = 0; i < weight.length; i++) {
    if (random < weight[i]) {
      result = arr[i];
      break;
    } else {
      random -= weight[i];
    }
  }

  await interaction.reply(`${result} `);
}
